Public Attributes | List of all members
API_RailingHandrailEndQuantity Struct Reference
Element Manager API
Calculated values for the handrail end of the railing. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | volume
Volume of the handrail end of the given railing.
double  | length3D
Length of the 3D reference line of the handrail end of the given railing.
Detailed Description
Calculated values for the handrail end of the railing.
Member Data Documentation
◆ length3D
 API_RailingHandrailEndQuantity::length3D
Length of the 3D reference line of the handrail end of the given railing.
◆ volume
 API_RailingHandrailEndQuantity::volume
Volume of the handrail end of the given railing.